let options = {
    color: "red",
    wheels: 4,
    hell: 6,
    engine: {
        cylinders: 'for',
        size: 100,
        test: {
            go: 'i am Vic',
            victor: 26
        }
    },
    makeTest: ()=>{
        console.log(Object.keys(options).length)
    }
};



//----------------------------------------------------------------
// for in - перебрать объект и вычислить ключ и значение
// for of не работает для объектов

// for (let a in options) {
//
//     console.log(`Свойство ${a} имеет значение  ${options[a]}`)
//
// }
//  for in - перебрать объект в объекте
// let counter = 0
// for (let a in options) {
//     if (typeof (options[a]) === "object") {
//         for (let i in options[a]) {
//             console.log(`Свойство ${i} имеет значение  ${options[a][i]}`)
//             // counter++
//         }
//     } else {
//         counter++
//         console.log(`Свойство ${a} имеет значение  ${options[a]}`)
//     }
// }


// подсчитать количество элементов внутри объекта
// let counter = 0
// for (let a in options) {
//         counter++
// }
// console.log(counter)


//----------------------------------------------------------------
// найти ключи нашего объекта / получаем массив со всеми ключами
// const arraySum = Object.keys(options).length
// console.log(arraySum)

// console.log(options.makeTest())

//----------------------------------------------------------------


const {color, wheels} = options

console.log(color)

//----------------------------------------------------------------

//----------------------------------------------------------------



//----------------------------------------------------------------


//----------------------------------------------------------------


//----------------------------------------------------------------


//----------------------------------------------------------------


